# Используем легковесный официальный образ Python
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Запрещаем Python писать файлы кэша .pyc на диск
ENV PYTHONDONTWRITEBYTECODE=1
# Запрещаем Python буферизировать логи (они будут сразу видны в консоли Docker)
ENV PYTHONUNBUFFERED=1

# Копируем файл зависимостей
COPY requirements.txt .

# Устанавливаем библиотеки (без сохранения кэша pip для уменьшения размера образа)
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь исходный код проекта (папку app) внутрь контейнера
COPY ./app ./app

# Открываем порт 8000 наружу
EXPOSE 8000

# Команда для запуска сервера внутри контейнера
# Используем хост 0.0.0.0, чтобы сервер принимал запросы извне контейнера
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8000"]